# St7SetInfluenceCombinationOptions

Sets the load influence combination generation options.

long St7SetInfluenceCombinationOptions(long uID, long* Integers)
Input Parameters
uID
Strand7 model file ID.
Integers[0..4]
Components to include in the names of load cases generated by St7GenerateInfluenceCases.
[ipInfCaseLabel] – btTrue to include the label, or btFalse to exclude it.
[ipInfCaseVariable] – btTrue to include the variable, or btFalse to exclude it.
[ipInfCaseLoadCase] – btTrue to include the load case, or btFalse to exclude it.
[ipInfCaseFreedomCase] – btTrue to include the freedom case, or btFalse to exclude it.
[ipInfCaseResponseType] – btTrue to include the response type, or btFalse to exclude it.